import axios from "axios"
let handler = async (m, {command, conn, usedPrefix}) => {
let res = (await axios.get(`https://telegra.ph/file/c1a30abfdc41574f17248.jpg`)).data  
let haha = await res[Math.floor(res.length * Math.random())]    
conn.sendFile(m.chat, haha, 'error.jpg', `
*❆❯━━━❲❄️❳━━━━━❮❆*

*❮ 🤖┇اسم البوت ↜ البيدو*
*❮ 👑┇مطور البوت ↜ دازاي | محمد*
*❮ 📱┇رقم المطور↜201552413139*
*❮ 🧾┇الـوضـع ↜ البوت عام للكل*
*❮ 🕜┇وقت التشغيل ↜ (uptime)*

*❆❯══⊹⊱≼ اوامر 🎴 البوت ≽⊰⊹══❮❆*

*❮ ⚜️┇حط رمز قبل الأمر مثل  ( / . )*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*『 ️👥 』⇦ قسم الجروبات ╿↶*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*👾┣.طرد*

*رفع|🤖*
*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*『 ️🔄 』⇦ قسم التحويل╿↶*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*🎴┣.تليجراف*

*🎴┣.خط*

*🎴┣.ملصق*

*🎴┣.سرقه*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*『 ️🥇 』⇦ قسم الرفيه ╿↶*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*🎮┣.اكس*
❍↜يشغل لعبه XO

*🎮┣.تحدي*
❍↜يشغل لعبه حجر ورقه مقص 

*🎮┣.فعاليات*
❍↜بيجبلك فعاليات تلقائي 

*🎮┣.لو*
❍↜لو خيروك 

*🎮┣.سؤال*
❍↜اساله انمي صعبه 

*🎮┣.اسئلني*
❍↜البوت يسألك أسأله عشوائيه 

*🎮┣.الحب*
❍↜يقيس نسبه الحب اليك 

*🎮┣.بيحبني*
❍↜يمنشن اللي بيحبك 

*🎮┣.الكره*
❍↜يقيس نسبه الكره لك 

*🎮┣.بيكرهني*
❍↜يمنشن اللي بيكرهك

*🎮┣.غباء*
❍↜يقيس نسبه الغباء

*🎮┣.ذكاء*
❍↜يقيس نسبه الذكاء 

*🎮┣.زواج*
❍↜يجوز اتنين من الجروب

*🎮┣.طلاق*
❍↜يطلق اتنين من الجروب

*🎮┣كت*
❍↜اسماء شخصيات انمي عشوائية 

*🎮┣استماره* 
❍↜بيجيب استماره لنقابات 

*🎮┣delxo* 
❍↜حذف غرفه اكس او 

*🎮┣شبهي* 
❍↜بيختار شخص عشوائي شبهك

*🎮┣جمال*
❍↜بيختار شخص عشوائي جميل

*🎮┣تاج* 
❍↜لعبه الصراحه

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*『 ️🖥️ 』⇦ قسم الذكاء الاصطناعي ╿↶*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*🤖┣.gpt*
❍↜شات gbt للاستفسار و الاساله ولاكن 
يجب أن تكتب الاستفسار أو السؤال بيدقه
لانهو مازال في مرحلة التطوير 

*🤖┣.هنري*
❍↜ذكاء اصطناعي مطور للرد علي كل الاساله 
و الاستفسارات و الثقافه وغيره لاكن يجب أن 
تنتظر حتي يرد علي كلامك لانهو ياخد القليل 
من الواقت


*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*『 ️♻️ 』⇦ قسم التنزيلات ╿↶*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*⚡┣.انستا*
❍↜بينزل فيديو من الانستجرام

*⚡┣.اغنيه*
❍↜بينزل اغاني

*⚡┣.اغاني*
❍↜بينزل اغاني من اليوتيوب

*⚡┣.فيسبوك*
❍↜بينزل فيديوهات من الفيس

*⚡┣.Apk*
❍↜بينزل العاب و تطبيقات

*⚡┣.تيك*
❍↜بينزل فيديو من التيك توك

*⚡┣.يوتيوب*
❍↜بينزل فيديو من االيوتيوب

*⚡┣.يوتيوبت*
❍↜بينزل فيديو من يوتيوب

*⚡┣.فريبيك*
❍↜بينزل صوره من موقع فريبيك☾

*⚡┣.صوره*
❍↜بينزل صور من جوجل

*⚡┣.جوجل*
❍↜بينزل من جوجل 

*⚡┣.شغل*
❍↜بينزل اغاني

*⚡┣.فيديوو*
❍↜بينزل فيديوهات

*⚡┣.بحثيوت*
❍↜بيبحث عن فيديوهات عل اليوتيوب

*⚡┣.Yts*
❍↜بينزل فيديوهات بجوده عاليه

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*『 ️☁️ 』⇦ قسم البحث ╿↶*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*🔎┣.يوتيوبس*
❍↜يبحث عاليوتيوب

*🔎┣.بحث*
❍↜بيبحث ف جوجل

*🔎┣.انمي*
❍↜بيجيب كل معلومات الانميات 

*🔎┣.انميس*
❍↜بيجيب احداث القصه لينك تنزيل جاهز

*🔎┣.طقم*
❍↜بيجب صوره بنت و ولد

*🔎┣.بين*
❍↜بيجيب صوره من بينترست

*🔎┣.انستا2*
❍↜بيجيب اي حاجه من الانستا 

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*『 ️🎯 』⇦ قسم العشوئيات ╿↶*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*🐈┣.قط* 
❍↜بيجيب صور قطط عشوائية 

*🐈┣.حيوان* 
❍↜بيجيب صور حيوانات عشوائية 

*⚽┣.ميسي* 
❍↜بيجيب صور لي ميسي عشوائية 

*⚽┣.رونالدو* 
❍↜بيجيب صور لي رونالدو عشوائية 

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*『 ️⛪ 』⇦ قسم البنك ╿↶*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*
  
*💵┣.البنك*
❍↜بيجبلك بنك البوت

*💵┣.الماس*
❍↜بيعت قائمة الالماس الخاصه بك

*💵┣.عمل*
❍↜بيديك مكافأة العمل

*💵┣.هجوم*
❍↜هجوم لتجميع الXP

*💵┣.اصف*
❍↜يضيف عملات

*💵┣.اكسبي*
❍↜بيجمع عملات

*💵┣.ترتيب*
❍↜بيجيب ترتيبك

*💵┣.لفل*
❍↜قائمه لفل الخاصة بك

*💵┣.تعدين*
❍↜مكافأة من البوت

*💵┣.يومي*
❍↜بيديك مكافأة يوميه

*💵┣.اسبوعي*
❍↜بيديك مكافأة اسبوعيه

*💵┣.شراء*
❍↜قائمه الشراء بالXP و الماس

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*『 ️🕋 』⇦ قسم الاسلامي ╿↶*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*🌷┣.سوره*
❍↜بيجبلك السوره والصوت

*🌷┣.اذكار الصباح*
❍↜بيبعت اذكار الصباح 

*🌷┣.اذكار المساء*
❍↜بيبعت اذكار المساء 

*🌷┣.قران*
❍↜بيبعت قران

*🌷┣.حديث*
❍↜بيبعت حديث

*🌷┣Ayat*
❍↜بيبعت أية الكرسي


*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*『 ️⭐ 』⇦ قسم المطور ╿↶*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*👑┣.بريم*
❍↜للمطور فقط

*👑┣بان*
❍↜للمطور فقط

*👑┣.رفع-البان*
❍↜للمطور فقط

*👑┣.حظر*
❍↜للمطور فقط

*👑┣.الغاء-الحظر*
❍↜للمطور فقط

*👑┣.المحظورين*
❍↜للمطور فقط

*👑┣.بلوك*
❍↜للمطور فقط

*👑┣.رفع-بلوك*
❍↜للمطور فقط

*👑┣.البلوكات*
❍↜للمطور فقط

*👑┣.مميزين*
❍↜بيظهر الأشخاص المميزين

*👑┣.انضم*
❍↜للمطور فقط

*👑┣.اخرج*
❍↜للمطور فقط

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*『 ️💻 』⇦ قسم الدعم ╿↶*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

*❗┣.المطور*

*❆❯══⊹⊱≼ ❄️ ≽⊰⊹══❮❆*

❍↜صلي علي النبي 🤍-

❍↜رقمي 🤍-

201552413139
201552413139

❍↜توقيع المطور 🤍-
- Dazai-mohamed -

*❆❯━━━❲❄️❳━━━━━❮❆*`, m)
}
handler.comm = handler.help = ['الاوامر','اوام']
handler.tags = ['anime']
handler.command = /^ألاوامر|أوامر|اومر|menu|اوامر$/i
export default handler
